# SQL advanced string functions

In this exercise, we will use the skills we have learned so far to solve complex problems that involve string manipulation and handling. Ensure that you have downloaded the database file, Northwind.db.

## Learning objectives

In this train, we will:
- Understand how to apply  SQL functions for data type conversion, null value handling, and string manipulation to solve complex problems.

First, let's load our database:

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Northwind database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///Northwind.db

Here is a view of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/Northwind_ERD.png"  style="width:70%";/>
<br>
<br>
    <em>Figure 1: Northwind database ERD</em>
</div>

## Exercise

### 1. Convert data type

Given the `Employees` table, write a SQL query to convert the salary of all employees from integer to string data type.

The `CAST` function is used to convert one data type to another. In this query, it is used to convert the `Salary` column from an integer to a string.

In [5]:
%%sql

SELECT
    CAST(Salary AS CHAR) AS SalaryString
FROM
    Employees;

 * sqlite:///Northwind.db
Done.

[('2954.55',),
 ('2254.49',),
 ('3119.15',),
 ('1861.08',),
 ('1744.21',),
 ('2004.07',),
 ('1991.55',),
 ('2100.5',),
 ('2333.33',)]

### 2. Trim strings

In the `Orders` table, some of the `ShipName` entries have leading and trailing white spaces. Write a SQL query to trim these white spaces.

The `TRIM` function is used to remove leading and trailing spaces from a string. This query uses `TRIM` to remove spaces from the `ShipName` entries.

In [9]:
%%sql

SELECT 
    TRIM(ShipName) AS TrimmedShipName
FROM 
    Orders
LIMIT 10;

 * sqlite:///Northwind.db
Done.

[('Vins et alcools Chevalier',),
 ('Toms Spezialitten',),
 ('Hanari Carnes',),
 ('Victuailles en stock',),
 ('Suprmes dlices',),
 ('Hanari Carnes',),
 ('Chop-suey Chinese',),
 ('Richter Supermarkt',),
 ('Wellington Importadora',),
 ('HILARION-Abastos',)]

### 3. Replace string

The `Customers` table contains null values in the `ContactTitle` column. Write a SQL command to replace these null values with the string 'N/A'.

The `COALESCE` function returns the first non-null value in a list. In this case, it's used to replace `NULL` values in the `ContactTitle` column with `'N/A'`.

In [10]:
%%sql

UPDATE 
    Customers
SET
    ContactTitle = COALESCE(ContactTitle, 'N/A');

 * sqlite:///Northwind.db
93 rows affected.

[]

### 4. Extract characters

Write a SQL command to extract the first three characters from the `City` column in the `Customers` table.

The `LEFT` function is used to extract a specified number of characters from a string, starting from the left. This query extracts the first three characters from the `City` column.

In [20]:
%%sql

SELECT 
    SUBSTRING(City, 1, 3) AS CitySubstring 
FROM 
    Customers
LIMIT 5;

 * sqlite:///Northwind.db
Done.

[('Ber',), ('Mxi',), ('Mxi',), ('Lon',), ('Lul',)]

### 5. String concatenation 

Write a SQL query to concatenate the `FirstName` and `LastName` of employees in the `Employees` table into a new column `FullName`.

The `CONCAT` function is used to combine two or more strings into one. This query concatenates the `FirstName` and `LastName` columns with a space in between.

In [29]:
%%sql

SELECT
    CONCAT(FirstName, ' ', LastName) AS FullName
FROM
    Employees
LIMIT 5;

 * sqlite:///Northwind.db
Done.

[('Nancy Davolio',),
 ('Andrew Fuller',),
 ('Janet Leverling',),
 ('Margaret Peacock',),
 ('Steven Buchanan',)]

### Challenge question 

You are working in the marketing department of your company and you have been given the task of conducting an email marketing campaign targeting all customers based in France.

You have a `Customers` table which includes an `Email` column. However, the data isn't perfect. Some email addresses might be duplicated, others might be `NULL`, and some might have unnecessary white spaces at the start or end of the address.

Your task is to clean up the data and compile a list of unique email addresses to use for the marketing campaign. Here are the requirements:

1. Exclude any `NULL` email addresses from your list. We can't send emails to addresses we don't have. 
2. Make sure there are no duplicates in your list. We don't want to annoy our customers by sending them the same email multiple times. 
3. Remove any unnecessary white spaces from the start or end of the email addresses. This will help avoid any errors when sending the emails.

Remember, the success of our campaign depends on the quality of this list!

Your output should look something like this, though the exact email addresses will depend on the data in your `Customers` table:

The SQL statement is reading data from the Customers table (`FROM` Customers).

The `WHERE` clause filters out the customers who are based in France `(Country = 'France')` and whose email address is not `NULL (AND Email IS NOT NULL)`.

The `SELECT DISTINCT TRIM(Email)` part of the statement is where the magic happens. `TRIM(Email)` removes any white spaces from the start and end of the email addresses. And `DISTINCT` ensures that each email address in your results is unique.

Thus, this query will return a list of unique, cleaned-up email addresses for all customers in France, ready for you to use in your marketing campaign.

customer1@example.com
customer2@example.com
customer3@example.com

In [ ]:
%%sql

SELECT 
    DISTINCT TRIM(Email) 
FROM 
    Customers 
WHERE 
    Country = 'France' 
    AND Email IS NOT NULL;